demo.org
#+title: cogs ⚙ demo
#+subtitle: Demonstration of Configuration Object Generation System
#+setupfile: setup.org
#+options: broken-links:mark

#+name: grep
#+begin_src shell :var re="" :var file="/dev/null"  :var a=0 :var lang="shell" :exports none :results output code
grep -m1 -A$a "$re" "$file"
#+end_src

#+name: runcmd
#+begin_src shell :var cmd="echo hello world" :exports none :results output code :wrap "example"
$cmd
#+end_src



* Introduction
  :PROPERTIES:
  :CUSTOM_ID: intro
  :END:

The [[file:demo/][demo/]] directory of the [[https://github.com/brettviren/cogs][cogs]] repository holds a demonstration of
one way to make use of ~cogs~.  It includes:

- A mocked up framework, application and components.
- Schema to generate configuration classes.
- Example ~cogs~ configuration stream file.
- Simple tooling to rerun code generation.
- Integration into ~cogs~ build system.

This document describes how to build and run the demo.  It then gives
a tour of the mocked framework to understand one possible way to allow
~cogs~ to be used.  Details on the code generation steps come next and
it ends with a section that uses the demo's schema to illustrate how
one may develop schema for applications.

* Build
  :PROPERTIES:
  :CUSTOM_ID: build
  :END:

This section describes issues about building the demo code. 

** Prerequisites
   :PROPERTIES:
   :CUSTOM_ID: prereq
   :END:

In addition to what ~cogs~ requires, the demo requires:

- Avro CPP library and headers

The generated demo code is committed to the repository.  To regenerate
it requires additionally:

- ~avrogencpp~ from Avro CPP package

- ~moo~ Python program from [[https://github.com/brettviren/moo][moo]].

** Compile
   :PROPERTIES:
   :CUSTOM_ID: compile
   :END:

With prerequisites satisfied, the demo builds with the ~cogs~ library.  For example:

#+begin_example
waf configure --prefix=$(pwd)/install \
    --with-nljs=$HOME/opt/nljs \
    --with-ers=$HOME/opt/ers \
    --with-avro=$HOME/opt/avro
waf install
#+end_example

You should be rewarded with:

#+begin_src shell :exports both :results output code :wrap "example"
./install/bin/cogs-demo || /bin/true
#+end_src

#+RESULTS:
#+begin_example
2020-Jun-25 12:17:22,617 INFO [main(...) at unknown/demo/cogs-demo.cpp:12] usage: ./install/bin/cogs-demo <uri>
#+end_example

** Regenerate
   :PROPERTIES:
   :CUSTOM_ID: regen
   :END:


The demo relies on generated code which is committed to the repository
to reduce the build-time dependency of ~cogs~.  If the additional
prerequisites are satisfied, it may be regenerated:

#+begin_src shell :exports both :results output code :wrap example
./demo/generate.sh
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Below we will look more at what this script does.

* Run
  :PROPERTIES:
  :CUSTOM_ID: run
  :END:


The demo provides a ready made ~cogs~ configuration stream file:

#+begin_src shell :exports both :results output code :wrap example
./install/bin/cogs-demo file://demo/demo-config.json | sed -e 's/^[^]]*\]//'
#+end_src

#+RESULTS:
#+begin_example
#+end_example





The ~sed~ is simply to remove ERS output augmentation more appropriate
to log files.  The output shows the configuration driving the
construction of a "node" and a "component" (the "source") followed by
their configuration.  When the node is configured it makes a (dummy)
"port" and hands that C++ object to the source.  The next section on
the demo framework describes these terms.  They are not inherent to
~cogs~ itself, just this demo but they represent typical code patterns.

* Framework
  :PROPERTIES:
  :CUSTOM_ID: framework
  :END:

It is possible to use ~cogs~ in a variety of patterns.  This demo
illustrates one particular pattern such as may be used in an
"application framework".  This pattern might be named something like
"factory configuration".  It provides for a highly flexible,
configuration-driven method for "aggregating" an application instance
from a set of factory-instantiated components.  

** Demo configuration stream
   :PROPERTIES:
   :CUSTOM_ID: config-stream
   :END:


The construction of the demo application and its configuration is
driven by a ~cogs~ configuration stream.  The stream is composed of a
sequence of pairs of configuration objects.  The first object in each
pair co responds to a fixed type of ~demo::ConfigurableBase~.  It
provides information required to locate a component instance.  The
second object in a pair corresponds to the configuration of that
component instance.

The stream is illustrated as:

|---------------------------------------|
| component 1: ~democfg::ConfigHeader~    |
|---------------------------------------|
| component 1: corresponding cfg object |
|---------------------------------------|
| ...                                   |
|---------------------------------------|
| component N: ~democfg::ConfigHeader~    |
|---------------------------------------|
| component N: corresponding cfg object |
|---------------------------------------|

** Dispatching configuration
   :PROPERTIES:
   :CUSTOM_ID: dispatch-config
   :END:

The ~ConfigHeader~ provides two attributes:

- implementation identifier :: this is some name associated with a
  construction method for an implementation of ~ConfigurableBase~.  This
  identifier is some simple name, likely derived from the component's
  C++ class name.

- instance identifier :: multiple instances of one component may be
  constructed and this identifier keeps then distinct.

The main application walks the ~cogs::Stream~ using the ~ConfigHeader~ to
retrieve an instance from the demo factory.  It then reads the next
object from the ~cogs::Stream~ and passes it to the component's
~configure()~ method.  When the stream is exhausted the demo app simply
exits.  A real app would of course go on to some other phase of
execution.

