demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-27 Sat 17:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cogs ⚙ demo</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/darksun.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">cogs ⚙ demo
<br />
<span class="subtitle">Demonstration of Configuration Object Generation System</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#intro">Introduction</a></li>
<li><a href="#build">Build</a>
<ul>
<li><a href="#prereq">Prerequisites</a></li>
<li><a href="#compile">Compile</a></li>
<li><a href="#regen">Regenerate</a></li>
</ul>
</li>
<li><a href="#run">Run</a></li>
<li><a href="#framework">Framework</a>
<ul>
<li><a href="#config-stream">Demo configuration stream</a></li>
<li><a href="#dispatch-config">Dispatching configuration</a></li>
<li><a href="#app-pattern">Non-trivial application patterns</a></li>
</ul>
</li>
<li><a href="#codegen">Codegen</a>
<ul>
<li><a href="#gen-avro">C++ configuration types</a></li>
<li><a href="#gen-nljs">Serialization code</a></li>
<li><a href="#gen-cfg">Configuration stream</a></li>
</ul>
</li>
<li><a href="#schema">Schema</a>
<ul>
<li><a href="#schema-layers">Layers</a></li>
<li><a href="#base-schema">Base schema</a></li>
<li><a href="#node-schema">Node schema</a></li>
<li><a href="#org6c37191">Configuration objects</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-intro" class="outline-2">
<h2 id="intro">Introduction</h2>
<div class="outline-text-2" id="text-intro">
<p>
The <a href="demo/">demo/</a> directory of the <a href="https://github.com/brettviren/cogs">cogs</a> repository holds a demonstration of
one way to make use of <code>cogs</code>.  It includes:
</p>

<ul class="org-ul">
<li>A mocked up framework, application and components.</li>
<li>Schema to generate configuration classes.</li>
<li>Example <code>cogs</code> configuration stream file.</li>
<li>Simple tooling to rerun code generation.</li>
<li>Integration into <code>cogs</code> build system.</li>
</ul>

<p>
This document describes how to build and run the demo.  It then gives
a tour of the mocked framework to understand one possible way to allow
<code>cogs</code> to be used.  Details on the code generation steps come next and
it ends with a section that uses the demo's schema to illustrate how
one may develop schema for applications.
</p>
</div>
</div>

<div id="outline-container-build" class="outline-2">
<h2 id="build">Build</h2>
<div class="outline-text-2" id="text-build">
<p>
This section describes issues about building the demo code. 
</p>
</div>

<div id="outline-container-prereq" class="outline-3">
<h3 id="prereq">Prerequisites</h3>
<div class="outline-text-3" id="text-prereq">
<p>
In addition to what <code>cogs</code> requires, the demo requires:
</p>

<ul class="org-ul">
<li>Avro CPO library and headers</li>
</ul>

<p>
The generated demo code is committed to the repository.  To regenerate
it requires additionally:
</p>

<ul class="org-ul">
<li><code>avrogencpp</code> from Avro CPP package</li>

<li><code>moo</code> Python program from <a href="https://github.com/brettviren/moo">moo</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-compile" class="outline-3">
<h3 id="compile">Compile</h3>
<div class="outline-text-3" id="text-compile">
<p>
With prerequisites satisfied, the demo builds with the <code>cogs</code> library.  For example:
</p>

<pre class="example">
waf configure --prefix=$(pwd)/install --with-nljs=$HOME/opt/nljs --with-ers=$HOME/opt/ers --with-avro=$HOME/opt/avro
waf install
</pre>

<p>
You should be rewarded with:
</p>

<div class="org-src-container">
<pre class="src src-shell">./install/bin/cogs-demo || /bin/true
</pre>
</div>

<pre class="example">

</pre>
</div>
</div>

<div id="outline-container-regen" class="outline-3">
<h3 id="regen">Regenerate</h3>
<div class="outline-text-3" id="text-regen">
<p>
The demo relies on generated code which is committed to the repository
to reduce the build-time dependency of <code>cogs</code>.  If the additional
prerequisites are satisfied, it may be regenerated:
</p>

<div class="org-src-container">
<pre class="src src-shell">./demo/generate.sh
</pre>
</div>

<pre class="example">

</pre>

<p>
Below we will look more at what this script does.
</p>
</div>
</div>
</div>

<div id="outline-container-run" class="outline-2">
<h2 id="run">Run</h2>
<div class="outline-text-2" id="text-run">
<p>
The demo provides a ready made <code>cogs</code> configuration stream file:
</p>

<div class="org-src-container">
<pre class="src src-shell">./install/bin/cogs-demo file://demo/demo-config.json | sed -e <span style="color: #e9b96e;">'s/^[^]]*\]//'</span>
</pre>
</div>

<pre class="example">

</pre>

<p>
The <code>sed</code> is simply to remove ERS output augmentation more appropriate
to log files.  The output shows the configuration driving the
construction of a "node" and a "component" (the "source") followed by
their configuration.  When the node is configured it makes a (dummy)
"port" and hands that C++ object to the source.  The next section on
the demo framework describes these terms.  They are not inherent to
<code>cogs</code> itself, just this demo but they represent typical code patterns.
</p>
</div>
</div>

<div id="outline-container-framework" class="outline-2">
<h2 id="framework">Framework</h2>
<div class="outline-text-2" id="text-framework">
<p>
It is possible to use <code>cogs</code> in a variety of patterns.  This demo
illustrates one particular pattern such as may be used in an
"application framework".  This pattern might be named something like
"factory configuration".  It provides for a highly flexible,
configuration-driven method for "aggregating" an application instance
from a set of factory-instantiated components.  
</p>
</div>

<div id="outline-container-config-stream" class="outline-3">
<h3 id="config-stream">Demo configuration stream</h3>
<div class="outline-text-3" id="text-config-stream">
<p>
The construction of the demo application and its configuration is
driven by a <code>cogs</code> configuration stream.  The stream is composed of a
sequence of pairs of configuration objects.  The first object in each
pair co responds to a fixed type of <code>demo::ConfigurableBase</code>.  It
provides information required to locate a component instance.  The
second object in a pair corresponds to the configuration of that
component instance.
</p>

<p>
The stream is illustrated as:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">component 1: <code>democfg::ConfigHeader</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">component 1: corresponding cfg object</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">component N: <code>democfg::ConfigHeader</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">component N: corresponding cfg object</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-dispatch-config" class="outline-3">
<h3 id="dispatch-config">Dispatching configuration</h3>
<div class="outline-text-3" id="text-dispatch-config">
<p>
The <code>ConfigHeader</code> provides two attributes:
</p>

<dl class="org-dl">
<dt>implementation identifier</dt><dd>this is some name associated with a
construction method for an implementation of <code>ConfigurableBase</code>.  This
identifier is some simple name, likely derived from the component's
C++ class name.</dd>

<dt>instance identifier</dt><dd>multiple instances of one component may be
constructed and this identifier keeps then distinct.</dd>
</dl>

<p>
The main application walks the <code>cogs::Stream</code> using the <code>ConfigHeader</code> to
retrieve an instance from the demo factory.  It then reads the next
object from the <code>cogs::Stream</code> and passes it to the component's
<code>configure()</code> method.  When the stream is exhausted the demo app simply
exits.  A real app would of course go on to some other phase of
execution.
</p>
</div>
</div>
