demo.html

<div id="outline-container-app-pattern" class="outline-3">
<h3 id="app-pattern">Non-trivial application patterns</h3>
<div class="outline-text-3" id="text-app-pattern">
<p>
The demo adds some non-trivial complexity by considering two types of
configurable objects:
</p>

<dl class="org-dl">
<dt>node</dt><dd>an object which has a collection of <i>ports</i> such may be
associated with sockets.  The demo keeps ports as dummies but they
represent some shared resource that is non-trivial to construct.</dd>

<dt>components</dt><dd>an object which is configurable and may also want to
use <i>ports</i>.  There is only a single component in the demo called a
"source".  It represents some arbitrary "code execution unit" aka
"user module".</dd>
</dl>

<p>
The <b>node</b> is really just another component but it is called out special
here as it uses the factory to locate instances of other components,
as directed by its configuration and in order to deliver fully formed
"ports".  A component must inherit from
<code>demo::PortuserBase</code> and be listed in the node's configuration in order
to receive its ports.
</p>

<p>
This pattern is a mock of a real implementation found in <a href="https://github.com/brettviren/zio">ZIO</a> which
uses a <a href="https://brettviren.github.io/zio/node.html">zio::Node</a> to create and link <a href="https://brettviren.github.io/zio/port.html">zio::Port</a> instances either
directly or automatically with the help of a <a href="https://brettviren.github.io/zio/peer.html">zio::Peer</a> performing
distributed network discovery.
</p>
</div>
</div>
</div>


<div id="outline-container-codegen" class="outline-2">
<h2 id="codegen">Codegen</h2>
<div class="outline-text-2" id="text-codegen">
<p>
This section provides a tour of the types of code generation commands
used to produce the bulk of the demo's code and configuration.  The
tour focuses on the <a href="demo/generate.sh">generate.sh</a> script.  This script runs its commands
from the <a href="demo/">demo/</a> directory and that should be taken into consideration
when reading excerpts of the script which are shown below.
</p>
</div>

<div id="outline-container-gen-avro" class="outline-3">
<h3 id="gen-avro">C++ configuration types</h3>
<div class="outline-text-3" id="text-gen-avro">
<p>
User code should not be burdened with validating and interpreting a
configuration byte stream or even a dynamic C++ object like
<code>nlohman::json</code>.  Instead, with <code>cogs</code> the user code receives a fully
typed C++ <code>struct</code>, thus guaranteeing at least valid object structure.
</p>

<p>
A configuration <code>struct</code> is produced in this demo using Avro CPP code
generator.  It consumes Avro schema files which are produced from the
demo's Jsonnet model in <a href="demo/demo-avro.jsonnet">demo-avro.jsonnet</a> using the <code>moo</code> tool:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #e090d7;">echo</span> <span style="color: #e9b96e;">"Compiling Avro schema files"</span>
moo compile -m . demo-avro.jsonnet
<span style="color: #e090d7;">echo</span> <span style="color: #e9b96e;">"Generating Avro code"</span>
<span style="color: #b4fa70;">for</span> n<span style="color: #b4fa70;"> in</span> *_avro.json; <span style="color: #b4fa70;">do</span>
    avrogencpp -n democfg -i $<span style="color: #fcaf3e;">n</span> -o $(<span style="color: #fa8072;">basename</span> $<span style="color: #fcaf3e;">n</span> .json).hpp &amp;&amp; rm $<span style="color: #fcaf3e;">n</span>
<span style="color: #b4fa70;">done</span>     
</pre>
</div>

<p>
one resulting file is at <a href="demo/node_avro.hpp">node<sub>avro.hpp</sub></a>.
</p>

<p>
Note, we must give the C++ <code>namespace</code> on this command line.  It is also
used elsewhere and is a case where some of the model "leaks" out of
the otherwise "sole source of truth", the Jsonnet.  Work is needed to
correct this.
</p>

<p>
The content of Jsonnet file <a href="demo/demo-avro.jsonnet">demo-avro.jsonnet</a> is:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #73d216;">// compile with -m</span>
<span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> moc = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moc.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> node = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"node-schema.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> comp = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"comp-schema.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> head = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"head-schema.jsonnet"</span>;

{
    <span style="color: #e9b96e;">"node_avro.json"</span>: node(moc.avro).types,
    <span style="color: #e9b96e;">"comp_avro.json"</span>: comp(moc.avro).types,
    <span style="color: #e9b96e;">"head_avro.json"</span>: head(moc.avro).types,
}
</pre>
</div>

<p>
Compiling to Avro schema is particularly easy since that format is
JSON.  The <code>moc.avro</code> "base schema" provided to the application schema
functions, eg <code>node()</code> cause Avro JSON to be output.  Instead passing
another base schema, eg, <code>moc.pbuf</code>, would produce a data structure
compliant with Protobuf schema which may the be applied to a suitable
template file in order to produce a Protobuf <code>.proto</code> file which can be
compiled to Protobuf C++ classes.  We'll see just this pattern in the
next section.
</p>

<p>
For these and other reasons, future work may revisit the use of Avro
for providing the configuration <code>struct</code> definition.  The demo does not
actually use Avro serialization (next section) which would make a
change easy.
</p>
</div>
</div>

<div id="outline-container-gen-nljs" class="outline-3">
<h3 id="gen-nljs">Serialization code</h3>
<div class="outline-text-3" id="text-gen-nljs">
<p>
While a <code>cogs</code> provides built-in support for JSON array or JSON stream
files, <code>cogs</code> streams are ultimately some form of byte streams.  An
intermediate representation of configuration information is provided
in the form of a <code>cogs::object</code> which is simply a <code>nlohmann::json</code>.  This
makes implementing the built-in JSON-based <code>cogs::Streams</code> rather
trivial while also provides a general purpose intermediary
representation which isolates low and high levels of <code>cogs</code>.  The
<code>nlohmann::json</code> package is further exploited by generating <code>to_json()</code>
and <code>from_json()</code> functions for every C++ type so that conversion
between a <code>cogs::object</code> and its corresponding C++ <code>struct</code> (generated as
above) is straight-forward.
</p>

<p>
This C++ code is generated as:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #e090d7;">echo</span> <span style="color: #e9b96e;">"Rendering nlohmann::json serialization code"</span>
moo render-many demo-render.jsonnet
</pre>
</div>

<p>
The <a href="demo/demo-render.jsonnet">demo-render.jsonnet</a> file holds:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moo = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moo.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> moc = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moc.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> node = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"node-schema.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> comp = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"comp-schema.jsonnet"</span>;
<span style="color: #b4fa70;">local</span> head = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"head-schema.jsonnet"</span>;

<span style="color: #b4fa70;">local</span> render_nljs = <span style="color: #b4fa70;">function</span>(name, schema) moo.render(
    model= {
        types: schema(moc.avro).types,
        namespace: <span style="color: #e9b96e;">"democfg"</span>,
        name:name,
    },
    template = <span style="color: #e9b96e;">"avro_nljs.hpp.j2"</span>,
    filename = name+<span style="color: #e9b96e;">"_nljs.hpp"</span>);

[
    render_nljs(<span style="color: #e9b96e;">"node"</span>,node),
    render_nljs(<span style="color: #e9b96e;">"comp"</span>,comp),
    render_nljs(<span style="color: #e9b96e;">"head"</span>,head),
]
</pre>
</div>

<p>
It is somewhat similar to <code>demo-avro.jsonnet</code> shown above and even uses
the same "base schema" as used to generate Avro schema.  However,
instead of providing Avro schema files which must be post-processed by
<code>avrogencpp</code>, it provides information that may be directly consumed and
applied against templates by the <code>moo</code> tool in order to produce all C++
code files in one go.  The generated NLJS C++ file for a "node" is at
<a href="demo/node_nljs.hpp"><code>node_nljs.hpp</code></a>
</p>
</div>
</div>
