demo.org
** Configuration stream
   :PROPERTIES:
   :CUSTOM_ID: gen-cfg
   :END:

We finally generate an example ~cogs~ configuration stream in the form
of a JSON file holding an array.  This file is created from Jsonnet by
~moo~:

#+call: grep("Compiling config", "demo/generate.sh", 1) :wrap "src shell"

#+RESULTS:
#+begin_src shell
echo "Compiling configuration to cogs stream file"
moo -D model compile demo-config.jsonnet > demo-config.json
#+end_src

The [[file:demo/demo-config.json][demo-config.json]] file is what was used above to run the demo.  It
is not long and so is included here:

#+include: demo/demo-config.json src json

You can see the paired objects, each preceded by what will be come a
~demo::ConfigHeader~ followed a an object of a specific type
corresponding to the component named in the preceding header.

Note, the choice of ordering is intentional.  It leads to the
construction and configuration of the ~demoSource~ prior to the use of
this component inside the node.  That use calls back to the component
in order to pass in the requested "port" objects.

* Schema
  :PROPERTIES:
  :CUSTOM_ID: schema
  :END:

This section describes how to develop schema.  It first describes the
layer of "application schema" and "abstract base schema".  It then
illustrates the elements of the the latter and walks through an
example of the former.

** Layers
   :PROPERTIES:
   :CUSTOM_ID: schema-layers
   :END:

The demo assumes two layers or schema.  The lowest is called an
"abstract base schema".  Strictly speaking it is a specification of a
set of function names and their arguments.  The demo then provides a
number of implementations of this base schema.  A implementation of a
base schema function then returns a corresponding data structure that
adheres to the schema vocabulary of a particular domain.  

For example, one base schema implementation provides structures
suitable for directly producing Avro schema JSON.  Another provides
structures which adhere to JSON Schema vocabulary.  Another example
given above is one that produces structure that may be applied to a
~message.proto.j2~ template to produce Protobuf ~.proto~ file that can
then be compiled into C++ classes via ~protoc~.

Using these primitive base functions, an application developer writes
the next layer of functions which emit schema that describes the
specific data types required by the developers components.  

The next section describes the functions provided by a base schema
followed by a tour of the application level schema for the
configuration used by the "node" component in the ~cogs~ demo.

** Base schema
   :PROPERTIES:
   :CUSTOM_ID: base-schema
   :END:

The base schema in its abstract form is a set of Jsonnet function
prototypes which are summarized here.  An implementation of an
abstract function is expected to return a description of the type
named by the function in some *domain vocabulary*.  For example the demo
provides one base implemented for the [[file:demo/avro-schema.jsonnet][Avro schema]] domain and one for
that of [[file:demo/json-schema.jsonnet][JSON Schema]].

Domains will differ in what they can meaningfully accept.  This means
that some domains may ignore some arguments to their functions.
Furthermore, some arguments are optional which are indicated by
setting default value to Jsonnet ~null~.  A domain may either provide a
default inside the function body or the argument shall be ignored (no
~null~ values should "leak out" from the functions).

The abstract base schema functions are:

- ~boolean()~ :: a Boolean type

- ~number(dtype, extra={})~ :: a numeric type.  The ~dtype~ argument should
  provide specific type information using Numpy codes (eg ~i4~ for C++
  ~int~, ~u2~ for C++ ~uint16_t~).  The ~extra~ may specify JSON Schema
  constraints.

- ~bytes(encoding=null, media_type=null)~ :: a sequence of byte values

- ~string(patern=null, format=null)~ :: a string type, ~pattern~ and
  ~format~ are JSON Schema arguments specifying a regular expression or
  a named format that a valid string must match.

- ~field(name, type, default=null, doc=null)~ :: an named and typed
  element in the context of a ~record~.  If the type is not scalar (eg,
  is a *record*) then ~type~ should be given as the name of the type.  The
  ~default~ may provide a default *value* of this field.  The ~doc~ provides
  a brief English description of the meaning of the field.

- ~record(name, fields=[], doc=null)~ :: a type which aggregates fields.
  This corresponds to a JSON object or a C++ ~struct~ or ~class~, etc.
  The ~fields~ array is a sequence of objects returned from the ~field()~
  function (from the same domain).

- ~sequence(type)~ :: an ordered sequence holding elements of type ~type~.  

- ~enum(name, symbols, default=null, doc=null)~ :: an enumerated type.
  The ~symbols~ is an array of string literals naming the enumerated
  values.  The ~default~ may specify an enumerated value to be used if
  otherwise not specified.

