demo.html


<div id="outline-container-gen-cfg" class="outline-3">
<h3 id="gen-cfg">Configuration stream</h3>
<div class="outline-text-3" id="text-gen-cfg">
<p>
We finally generate an example <code>cogs</code> configuration stream in the form
of a JSON file holding an array.  This file is created from Jsonnet by
<code>moo</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #e090d7;">echo</span> <span style="color: #e9b96e;">"Compiling configuration to cogs stream file"</span>
moo compile -D model demo-config.jsonnet &gt; demo-config.json
</pre>
</div>

<p>
The <a href="demo/demo-config.json">demo-config.json</a> file is what was used above to run the demo.  It
is not long and so is included here:
</p>

<div class="org-src-container">
<pre class="src src-json">[
    {
        <span style="color: #b4fa70;">"impname"</span>: <span style="color: #e9b96e;">"demoSource"</span>,
        <span style="color: #b4fa70;">"instname"</span>: <span style="color: #e9b96e;">"mycomp_source1"</span>
    },
    {
        <span style="color: #b4fa70;">"ntosend"</span>: <span style="color: #e9b2e3;">42</span>
    },
    {
        <span style="color: #b4fa70;">"impname"</span>: <span style="color: #e9b96e;">"demoNode"</span>,
        <span style="color: #b4fa70;">"instname"</span>: <span style="color: #e9b96e;">"mynode_inst1"</span>
    },
    {
        <span style="color: #b4fa70;">"compdefs"</span>: [
            {
                <span style="color: #b4fa70;">"config"</span>: <span style="color: #e9b96e;">""</span>,
                <span style="color: #b4fa70;">"ident"</span>: <span style="color: #e9b96e;">"mycomp_source1"</span>,
                <span style="color: #b4fa70;">"portlist"</span>: [
                    <span style="color: #e9b96e;">"src"</span>
                ],
                <span style="color: #b4fa70;">"type_name"</span>: <span style="color: #e9b96e;">"demoSource"</span>
            }
        ],
        <span style="color: #b4fa70;">"ident"</span>: <span style="color: #e9b96e;">"mynode1"</span>,
        <span style="color: #b4fa70;">"portdefs"</span>: [
            {
                <span style="color: #b4fa70;">"ident"</span>: <span style="color: #e9b96e;">"src"</span>,
                <span style="color: #b4fa70;">"links"</span>: [
                    {
                        <span style="color: #b4fa70;">"address"</span>: <span style="color: #e9b96e;">""</span>,
                        <span style="color: #b4fa70;">"linktype"</span>: <span style="color: #e9b96e;">"bind"</span>
                    }
                ]
            }
        ]
    }
]
</pre>
</div>

<p>
You can see the paired objects, each preceded by what will be come a
<code>demo::ConfigHeader</code> followed a an object of a specific type
corresponding to the component named in the preceding header.
</p>

<p>
Note, the choice of ordering is intentional.  It leads to the
construction and configuration of the <code>demoSource</code> prior to the use of
this component inside the node.  That use calls back to the component
in order to pass in the requested "port" objects.
</p>
</div>
</div>
</div>

<div id="outline-container-schema" class="outline-2">
<h2 id="schema">Schema</h2>
<div class="outline-text-2" id="text-schema">
<p>
This section describes how to develop schema.  It first describes the
layer of "application schema" and "abstract base schema".  It then
illustrates the elements of the the latter and walks through an
example of the former.
</p>
</div>

<div id="outline-container-schema-layers" class="outline-3">
<h3 id="schema-layers">Layers</h3>
<div class="outline-text-3" id="text-schema-layers">
<p>
The demo assumes two layers or schema.  The lowest is called an
"abstract base schema".  Strictly speaking it is a specification of a
set of function names and their arguments.  The demo then provides a
number of implementations of this base schema.  A implementation of a
base schema function then returns a corresponding data structure that
adheres to the schema vocabulary of a particular domain.  
</p>

<p>
For example, one base schema implementation provides structures
suitable for directly producing Avro schema JSON.  Another provides
structures which adhere to JSON Schema vocabulary.  Another example
given above is one that produces structure that may be applied to a
<code>message.proto.j2</code> template to produce Protobuf <code>.proto</code> file that can
then be compiled into C++ classes via <code>protoc</code>.
</p>

<p>
Using these primitive base functions, an application developer writes
the next layer of functions which emit schema that describes the
specific data types required by the developers components.  
</p>

<p>
The next section describes the functions provided by a base schema
followed by a tour of the application level schema for the
configuration used by the "node" component in the <code>cogs</code> demo.
</p>
</div>
</div>

<div id="outline-container-base-schema" class="outline-3">
<h3 id="base-schema">Base schema</h3>
<div class="outline-text-3" id="text-base-schema">
<p>
The base schema in its abstract form is a set of Jsonnet function
prototypes which are summarized here.  An implementation of an
abstract function is expected to return a description of the type
named by the function in some <b>domain vocabulary</b>.  For example the demo
provides one base implemented for the <a href="demo/avro-schema.jsonnet">Avro schema</a> domain and one for
that of <a href="demo/json-schema.jsonnet">JSON Schema</a>.
</p>

<p>
Domains will differ in what they can meaningfully accept.  This means
that some domains may ignore some arguments to their functions.
Furthermore, some arguments are optional which are indicated by
setting default value to Jsonnet <code>null</code>.  A domain may either provide a
default inside the function body or the argument shall be ignored (no
<code>null</code> values should "leak out" from the functions).
</p>

<p>
The abstract base schema functions are:
</p>

<dl class="org-dl">
<dt><code>boolean()</code></dt><dd>a Boolean type</dd>

<dt><code>number(dtype, extra={})</code></dt><dd>a numeric type.  The <code>dtype</code> argument should
provide specific type information using Numpy codes (eg <code>i4</code> for C++
<code>int</code>, <code>u2</code> for C++ <code>uint16_t</code>).  The <code>extra</code> may specify JSON Schema
constraints.</dd>

<dt><code>bytes(encoding=null, media_type=null)</code></dt><dd>a sequence of byte values</dd>

<dt><code>string(patern=null, format=null)</code></dt><dd>a string type, <code>pattern</code> and
<code>format</code> are JSON Schema arguments specifying a regular expression or
a named format that a valid string must match.</dd>

<dt><code>field(name, type, default=null, doc=null)</code></dt><dd>an named and typed
element in the context of a <code>record</code>.  If the type is not scalar (eg,
is a <b>record</b>) then <code>type</code> should be given as the name of the type.  The
<code>default</code> may provide a default <b>value</b> of this field.  The <code>doc</code> provides
a brief English description of the meaning of the field.</dd>

<dt><code>record(name, fields=[], doc=null)</code></dt><dd>a type which aggregates fields.
This corresponds to a JSON object or a C++ <code>struct</code> or <code>class</code>, etc.
The <code>fields</code> array is a sequence of objects returned from the <code>field()</code>
function (from the same domain).</dd>

<dt><code>sequence(type)</code></dt><dd>an ordered sequence holding elements of type <code>type</code>.</dd>

<dt><code>enum(name, symbols, default=null, doc=null)</code></dt><dd>an enumerated type.
The <code>symbols</code> is an array of string literals naming the enumerated
values.  The <code>default</code> may specify an enumerated value to be used if
otherwise not specified.</dd>
</dl>
</div>
</div>
