demo.org
** Node schema
   :PROPERTIES:
   :CUSTOM_ID: node-schema
   :END:

The concept of a "node" in this demo has been descried above.  Here we
examine the [[file:demo/node-schema.jsonnet][node-schema.jsonnet]] file as an example of an
application-level schema.  

First we look at the high-level structure of the file:

#+begin_src jsonnet
function(schema) {
    // defines types
    types: [ typeA, typeB, ...]
}
#+end_src

This Jsonnet compiles down to a single function object which takes the
argument ~schema~ which provides a set of base schema functions such as
described in the previous sections.  The primary result of this
function is to return a Jsonnet object (~{...}~) which contains an
attribute ~types~ holding an array of objects describing types
constructed through calls to functions provided by ~schema~.

Looking at the first few lines:

#+call: grep("local re", "demo/node-schema.jsonnet", 2) :wrap "src jsonnet"

#+RESULTS:
#+begin_src jsonnet
local re = import "re.jsonnet";
function(schema) {
    local ident = schema.string("Ident", pattern=re.ident_only),
#+end_src

Here, the Jsonnet file [[file:demo/re.jsonnet][re.jsonnet]] is imported and is provided by ~moo~.
It contains a set of regular expressions that are to be used to
constrain the validity of strings in the schema.  For example it
begins with:

#+begin_src jsonnet
{
    // Basic identifier (restrict to legal C variable nam)
    ident: '[a-zA-Z][a-zA-Z0-9_]*',
    ident_only: '^' + self.ident + '$',
#+end_src

Thus a string with ~pattern~ set to ~ident~ may be validated to hold only
a limited alphanumeric content.  

Back to ~node-shcema.jsonnet~, we ~ident~ defined as a string with a
pattern ~re.ident_only~ as a Jsonnet ~local~.  This means the variable is
temporary and known only in the scope of the object.  This lets it be
referred to simply by the name ~ident~ later.

Next we find an example of an ~enum~ and a ~record~ which describe a "link":

#+call: grep("local address", "demo/node-schema.jsonnet", 9) :wrap "src jsonnet"

#+RESULTS:
#+begin_src jsonnet
    local address = schema.string("Address", pattern=re.uri),

    local ltype = schema.enum("LinkType", ["bind","connect"], default="bind",
                         doc="How a port links to an address"),
    local link = schema.record("Link", fields= [
        schema.field("linktype", ltype,
                doc="The socket may bind or connect the link"),
        schema.field("address", address, 
                doc="The address to link to")
    ], doc="Describes how a single link is to be made"),
#+end_src

A "link" is intended to generalize the concept of relationship of a
socket and an address.  The ~LinkType~ represents one of the two allowed
link mechanism (a ~bind()~ or a ~connect()~).  Note how the Jsonnet
representation of this type is used to further define the ~Link~ along
with the representation of a string type ~Address~.  In a real system
like ZIO, an address is in the form of a URL like ~tcp://127.0.0.1:5678~
for direct ZeroMQ addressing or ~zyre://nodename/portname~ for automated
network peer discovery.

Next we come to a "port":

#+call: grep("local port", "demo/node-schema.jsonnet", 5) :wrap "src jsonnet"

#+RESULTS:
#+begin_src jsonnet
    local port = schema.record("Port", fields=[
        schema.field("ident", ident,
                doc="Identify the port uniquely in th enode"),
        schema.field("links", linklist, 
                doc="Describe how this port should link to addresses"),
    ], doc="A port configuration object",),
#+end_src

A port is another ~record~ with an identifier (name) of a type ~ident~
which we defined above.  That is, a string which may be validated
against a regular expression.  The second field is ~links~ which is a
~sequence~.  In ZIO a port corresponds to a ZeroMQ socket which may have
a multitude of both ~bind()~ and ~connect()~ links.

Next we define the part of the node configuration which describes what
a node needs to know in order to interact with a component:

#+call: grep("local comp", "demo/node-schema.jsonnet", 9) :wrap "src jsonnet"

#+RESULTS:
#+begin_src jsonnet
    local comp = schema.record("Comp", fields=[
        schema.field("ident", ident, 
                doc="Identify copmponent instance uniquely in the node"),
        schema.field("type_name", ident, 
                doc="Identify the component implementation"),
        schema.field("portlist", portlist,
                doc="Identity of ports required by component"),
        schema.field("config", extra_config,
                doc="Per instance configuration string used by node")
    ], doc="An object used by the node to partly configure a component"),
#+end_src

The first two fields are identifiers used to look up the component
using the factory (ie, matching what is also provided to ~main()~ in the
header object).  The ~portlist~ is a sequence of identifiers which must
mach those used in defining a ~Port~ above.  This required consistency
can be enforced by Jsonnet when generating actual configuration
objects as described in the next section.  And, finally, an arbitrary
extra string is provided which the demo does not actually use for
anything.  It may be used by the node to interpret some special action
on the component (eg, "ignore" or something).

Penultimately, we get to the top level of the "node" schema:

#+call: grep("local node", "demo/node-schema.jsonnet", 7) :wrap "src jsonnet"

#+RESULTS:
#+begin_src jsonnet
    local node = schema.record("Node", fields=[
        schema.field("ident", ident,
                doc="Idenfity the node instance"),
        schema.field("portdefs", portdefs,
                doc="Define ports on the node to be used by components"),
        schema.field("compdefs", compdefs,
                doc="Define components the node should instantiate and configure"),
    ], doc="A node configures ports and components"),
#+end_src

This defines a ~record~ type ~Node~ with fields meant to hold the port and
component definitions.

And, finally, the "return" value collects all the types:

#+call: grep("types:", "demo/node-schema.jsonnet", 2) :wrap "src jsonnet"

#+RESULTS:
#+begin_src jsonnet
    types: [ ident, address, ltype, link, linklist,
             port, portlist, portdefs,
             extra_config, comp, compdefs, node ],
#+end_src

