demo.html

<div id="outline-container-node-schema" class="outline-3">
<h3 id="node-schema">Node schema</h3>
<div class="outline-text-3" id="text-node-schema">
<p>
The concept of a "node" in this demo has been descried above.  Here we
examine the <a href="demo/node-schema.jsonnet">node-schema.jsonnet</a> file as an example of an
application-level schema.  
</p>

<p>
First we look at the high-level structure of the file:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">function</span>(schema) {
    <span style="color: #73d216;">// defines types</span>
    types: [ typeA, typeB, ...]
}
</pre>
</div>

<p>
This Jsonnet compiles down to a single function object which takes the
argument <code>schema</code> which provides a set of base schema functions such as
described in the previous sections.  The primary result of this
function is to return a Jsonnet object (<code>{...}</code>) which contains an
attribute <code>types</code> holding an array of objects describing types
constructed through calls to functions provided by <code>schema</code>.
</p>

<p>
Looking at the first few lines:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> re = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"re.jsonnet"</span>;
<span style="color: #b4fa70;">function</span>(schema) {
    <span style="color: #b4fa70;">local</span> ident = schema.string(pattern=re.ident_only),
</pre>
</div>

<p>
Here, the Jsonnet file <a href="demo/re.jsonnet">re.jsonnet</a> is imported.  It contains a set of
regular expressions that are to be used to constrain the validity of
strings in the schema.  For example it begins with:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet">{
    <span style="color: #73d216;">// Basic identifier (restrict to legal C variable nam)</span>
    ident: <span style="color: #e9b96e;">'[a-zA-Z][a-zA-Z0-9_]*'</span>,
    ident_only: <span style="color: #e9b96e;">'^'</span> + <span style="color: #b4fa70;">self</span>.ident + <span style="color: #e9b96e;">'$'</span>,
</pre>
</div>

<p>
Thus a string with <code>pattern</code> set to <code>ident</code> may be validated to hold only
a limited alphanumeric content.  
</p>

<p>
Back to <code>node-shcema.jsonnet</code>, we <code>ident</code> defined as a string with a
pattern <code>re.ident_only</code> as a Jsonnet <code>local</code>.  This means the variable is
temporary and known only in the scope of the object.  This lets it be
referred to simply by the name <code>ident</code> later.
</p>

<p>
Next we find an example of an <code>enum</code> and a <code>record</code> which describe a "link":
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> ltype = schema.enum(<span style="color: #e9b96e;">"LinkType"</span>, [<span style="color: #e9b96e;">"bind"</span>,<span style="color: #e9b96e;">"connect"</span>], default=<span style="color: #e9b96e;">"bind"</span>,
                     doc=<span style="color: #e9b96e;">"How a port links to an address"</span>),
<span style="color: #b4fa70;">local</span> link = schema.record(<span style="color: #e9b96e;">"Link"</span>, fields= [
    schema.field(<span style="color: #e9b96e;">"linktype"</span>, <span style="color: #e9b96e;">"LinkType"</span>,
            doc=<span style="color: #e9b96e;">"The socket may bind or connect the link"</span>),
    schema.field(<span style="color: #e9b96e;">"address"</span>, address, 
            doc=<span style="color: #e9b96e;">"The address to link to"</span>)
</pre>
</div>

<p>
A "link" is intended to generalize the concept of a socket <code>bind()</code> or a
<code>connect()</code> with an "address".  In a real system like ZIO, an address is
in the form of a URL like <code>tcp://127.0.0.1:5678</code> for direct ZeroMQ
addressing or <code>zyre://nodename/portname</code> for automated network peer
discovery.
</p>

<p>
Next we come to a "port":
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> port = schema.record(<span style="color: #e9b96e;">"Port"</span>, fields=[
    schema.field(<span style="color: #e9b96e;">"ident"</span>, ident,
            doc=<span style="color: #e9b96e;">"Identify the port uniquely in th enode"</span>),
    schema.field(<span style="color: #e9b96e;">"links"</span>, schema.sequence(<span style="color: #e9b96e;">"Link"</span>), 
            doc=<span style="color: #e9b96e;">"Describe how this port should link to addresses"</span>),
], doc=<span style="color: #e9b96e;">"A port configuration object"</span>,),
</pre>
</div>

<p>
A port is another <code>record</code> with an identifier (name) of a type <code>ident</code>
which we defined above.  That is, a string which may be validated
against a regular expression.  The second field is <code>links</code> which is a
<code>sequence</code>.  In ZIO a port corresponds to a ZeroMQ socket which may have
a multitude of both <code>bind()</code> and <code>connect()</code> links.
</p>

<p>
Next we define the part of the node configuration which describes what
a node needs to know in order to interact with a component:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> comp = schema.record(<span style="color: #e9b96e;">"Comp"</span>, fields=[
    schema.field(<span style="color: #e9b96e;">"ident"</span>, ident, 
            doc=<span style="color: #e9b96e;">"Identify copmponent instance uniquely in the node"</span>),
    schema.field(<span style="color: #e9b96e;">"type_name"</span>, ident, 
            doc=<span style="color: #e9b96e;">"Identify the component implementation"</span>),
    schema.field(<span style="color: #e9b96e;">"portlist"</span>, schema.sequence(ident), 
            doc=<span style="color: #e9b96e;">"Identity of ports required by component"</span>),
    schema.field(<span style="color: #e9b96e;">"config"</span>, schema.string(), 
            doc=<span style="color: #e9b96e;">"Per instance configuration string used by node"</span>)
], doc=<span style="color: #e9b96e;">"An object used by the node to partly configure a component"</span>),
</pre>
</div>

<p>
The first two fields are identifiers used to look up the component
using the factory (ie, matching what is also provided to <code>main()</code> in the
header object).  The <code>portlist</code> is a sequence of identifiers which must
mach those used in defining a <code>Port</code> above.  This required consistency
can be enforced by Jsonnet when generating actual configuration
objects as described in the next section.  And, finally, an arbitrary
extra string is provided which the demo does not actually use for
anything.  It may be used by the node to interpret some special action
on the component (eg, "ignore" or something).
</p>

<p>
Penultimately, we get to the top level of the "node" schema:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> node = schema.record(<span style="color: #e9b96e;">"Node"</span>, fields=[
    schema.field(<span style="color: #e9b96e;">"ident"</span>, ident,
            doc=<span style="color: #e9b96e;">"Idenfity the node instance"</span>),
    schema.field(<span style="color: #e9b96e;">"portdefs"</span>, schema.sequence(<span style="color: #e9b96e;">"Port"</span>), 
            doc=<span style="color: #e9b96e;">"Define ports on the node to be used by components"</span>),
    schema.field(<span style="color: #e9b96e;">"compdefs"</span>, schema.sequence(<span style="color: #e9b96e;">"Comp"</span>),
            doc=<span style="color: #e9b96e;">"Define components the node should instantiate and configure"</span>),
], doc=<span style="color: #e9b96e;">"A node configures ports and components"</span>),
</pre>
</div>

<p>
This defines a <code>record</code> type <code>Node</code> with fields meant to hold the port and
component definitions.
</p>

<p>
And, finally, the "return" value collects all the types:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet">    types: [ ltype, link, port, comp, node ],
}
</pre>
</div>
</div>
</div>
