demo.org
** Configuration objects

The demo generates a configuration stream (JSON array) with
[[file:demo/demo-config.jsonnet][demo-config.jsonnet]].  It defines two top level attributes: ~model~ which
provides the configuration sequence and ~schema~ which is a sequence of
objects in JSON Schema vocabulary.

The configuration stream can first be validated with ~moo~:

#+begin_example
moo -S schema -D model \
   validate --sequence \
   -s demo/demo-config.jsonnet \
      demo/demo-config.jsonnet
#+end_example

This tells ~moo~ to assume both the named model and schema are actually
each a sequence of model or schema, respectively and then to test each
pair one by one.  Success is marked by a ~null~ for each.  Failure will
be greeted with information indicating where the model is invalid.

When valid the model may be compiled into a form that can be consumed
as a ~cogs~ stream:

#+begin_example
moo -D model  compile demo/demo-config.jsonnet > demo/demo-config.json
#+end_example

One may now go back to the section above [[Run]] where we ran this configuration through the ~cogs-demo~ application.
