demo.html

<div id="outline-container-org6c37191" class="outline-3">
<h3 id="org6c37191">Configuration objects</h3>
<div class="outline-text-3" id="text-org6c37191">
<p>
The demo generates a configuration stream (JSON array) with
<a href="demo/demo-config.jsonnet">demo-config.jsonnet</a>.  It defines two top level attributes: <code>model</code> which
provides the configuration sequence and <code>schema</code> which is a sequence of
objects in JSON Schema vocabulary.
</p>

<p>
The configuration stream can first be validated with <code>moo</code>:
</p>

<pre class="example">
moo validate --sequence \
  -S schema -s demo/demo-config.jsonnet \
  -D model demo/demo-config.jsonnet
</pre>

<p>
This tells <code>moo</code> to assume both the named model and schema are actually
each a sequence of model or schema, respectively and then to test each
pair one by one.  Success is marked by a <code>null</code> for each.  Failure will
be greeted with information indicating where the model is invalid.
</p>

<p>
When valid the model may be compiled into a form that can be consumed
as a <code>cogs</code> stream:
</p>

<pre class="example">
moo compile -D model demo/demo-config.jsonnet &gt; demo/demo-config.json
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2020-06-27 Sat 17:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
